RomeroFrancisco/app/Controllers/Carrito.php

INSERT INTO `factura_cabecera` (`id_usuario`, `fecha_compra`, `total`, `activo`) VALUES ('15', '2025-06-23', 276, 1)
INSERT INTO `factura_detalle` (`id_factura_cabecera`, `id_producto`, `cantidad`, `precio`) VALUES (6, '23', '1', '46.00')
UPDATE `carrito` SET `activo` = 0
WHERE `carrito`.`id_carrito` IN ('27')
---
    public function comprar()
{
    $idUsuario = session()->get('id_usuario');
    if (!$idUsuario) return redirect()->to('/login');

    $items = $this->carritoModel->getCarritoByUser($idUsuario);
    $total = $this->carritoModel->calcularTotalCarrito($idUsuario);

    $facturaModel = new \App\Models\FacturaCabeceraModel();
    $facturaId = $facturaModel->insert([
        'id_usuario' => $idUsuario,
        'fecha_compra' => date('Y-m-d'),
        'total' => $total,
        'activo' => 1
    ]);

    $detalleModel = new \App\Models\FacturaDetalleModel();
    foreach ($items as $item) {
        $detalleModel->insert([
            'id_factura_cabecera' => $facturaId,
            'id_producto' => $item['id_productos'],
            'cantidad' => $item['cantidad'],
            'precio' => $item['precio_venta']
        ]);

        $this->carritoModel->update($item['id_carrito'], ['activo' => 0]);