RomeroFrancisco/app/Controllers/Catalogo.php

SELECT *
FROM `generos`
WHERE `activo` = 1
---
    public function catalogoInicio()
    {
        $generos = $this->generosModel->where('activo', 1)->findAll();