RomeroFrancisco/app/Controllers/Factura.php

    public function ver($idFactura)
    {
        $factura = $this->facturaModel->find($idFactura);

        $detalles = $this->detalleModel
            ->select('factura_detalle.*, productos.nombre as producto_nombre')
            ->join('productos', 'productos.id_producto = factura_detalle.id_producto')
            ->where('factura_detalle.id_factura_cabecera', $idFactura)
            ->findAll();
---
SELECT `factura_detalle`.*, `productos`.`nombre` as `producto_nombre`
FROM `factura_detalle`
JOIN `productos` ON `productos`.`id_producto` = `factura_detalle`.`id_producto`
WHERE `factura_detalle`.`id_factura_cabecera` = '6'