RomeroFrancisco/app/Views/components/header.php

                    $db = \Config\Database::connect();
                    $builder = $db->table('consultas');
                    $current_user_id = session()->get('id_usuario');
                    $respuestas_pendientes_cliente = $builder->where('id_usuario', $current_user_id)
                        ->where('Respondida', 1)
                        ->where('vista_por_cliente', 0)
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `consultas`
WHERE `id_usuario` = '15'
AND `Respondida` = 1
AND `vista_por_cliente` = 0

                    </a>
                    <ul class="dropdown-menu dropdown-menu-end custom-dropdown" aria-labelledby="notificationDropdown">
                        <?php
                            $all_consultas = $builder->select('id_consulta, motivoConsulta, Respuesta, fecha, Respondida')
                                ->where('id_usuario', $current_user_id)
                                ->orderBy('fecha', 'DESC')
                                ->get()
                                ->getResultArray();
---
SELECT `id_consulta`, `motivoConsulta`, `Respuesta`, `fecha`, `Respondida`
FROM `consultas`
WHERE `id_usuario` = '15'
ORDER BY `fecha` DESC