RomeroFrancisco/app/Models/CarritoModel.php

SELECT `carrito`.*, `productos`.`nombre`, `productos`.`precio_venta`, `productos`.`url_imagen`
FROM `carrito`
JOIN `productos` ON `productos`.`id_producto` = `carrito`.`id_productos`
WHERE `carrito`.`id_usuario` = '15'
AND `carrito`.`activo` = 1
---
    public function getCarritoByUser($idUsuario)
    {
        return $this->select('carrito.*, productos.nombre, productos.precio_venta, productos.url_imagen')
            ->join('productos', 'productos.id_producto = carrito.id_productos')
            ->where(['carrito.id_usuario' => $idUsuario, 'carrito.activo' => 1])
            ->findAll();